lisp/init-better-defaults.org
* Better Defaults
** define abbrev table
;;自定义补齐功能
#+BEGIN_SRC emacs-lisp
(setq-default abbrev-mode t)
(define-abbrev-table 'global-abbrev-table '(
					    ("el" "emacs-lisp")
					    ))
#+END_SRC

** file operate
;;去掉备份文件
#+BEGIN_SRC emacs-lisp
(setq make-backup-files nil)
#+END_SRC

;;禁止自动保存
#+BEGIN_SRC emacs-lisp
(setq auto-save-default nil)
#+END_SRC

;;设置最近打开文件
#+BEGIN_SRC emacs-lisp
(require 'recentf)
(recentf-mode 1)
(setq recentf-max-menu-items 25)
#+END_SRC
** programing
;;补全功能
#+BEGIN_SRC emacs-lisp
(setq hippie-expand-try-function-list '(try-expand-debbrev
					try-expand-debbrev-all-buffers
					try-expand-debbrev-from-kill
					try-complete-file-name-partially
					try-complete-file-name
					try-expand-all-abbrevs
					try-expand-list
					try-expand-line
					try-complete-lisp-symbol-partially
					try-complete-lisp-symbol))
#+END_SRC

;;括号匹配
#+BEGIN_SRC emacs-lisp
(add-hook 'emacs-lisp-mode-hook 'show-paren-mode)
#+END_SRC

;;删除选中位置
#+BEGIN_SRC emacs-lisp
(delete-selection-mode t)
#+END_SRC

;;代码缩进
#+BEGIN_SRC emacs-lisp
(defun indent-buffer()
  (interactive)
  (indent-region (point-min) (point-max)))
(defun indent-region-or-buffer()
(interactive)
  (save-excursion
    (if (region-active-p)
	(progn
	  (indent-region (region-beginning) (region-end))
	  (message "Indent selected region."))
      (progn
	(indent-buffer)
	(message "Indent buffer.")))))
#+END_SRC

** others
;;显示行号
#+BEGIN_SRC emacs-lisp
(global-linum-mode t)
(global-auto-revert-mode t)
#+END_SRC

;;声音取消
#+BEGIN_SRC emacs-lisp
(setq ring-bell-function 'ignore)
#+END_SRC

;;别名
#+BEGIN_SRC emacs-lisp
(fset 'yes-or-no-p 'y-or-n-p)
#+END_SRC

* provide
#+BEGIN_SRC emacs-lisp
(provide 'init-better-defaults)
#+END_SRC













